Documents/CRM_ЗаявкаНаПодборАвтомобиля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>CRM_ЗаявкаНаПодборАвтомобиля</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комплектация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цвета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_СтатусыЗаявокАвтосклад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийЛогиста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусИзменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОрдераSedre</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>БазовыеОпции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОпцияСпр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Опции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Опция</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДопОпции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Опция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Опции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/CRM_РезервыАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_РезервыАвтомобилей</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контролер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_СтатусыРезервовАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SedreNum</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаявкаНаРезерв</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CRM_ЗаявкаНаПодборАвтомобиля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/CRM_СтатусыЗаявокАвтосклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>CRM_СтатусыЗаявокАвтосклад</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеПринятаКРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/CRM_СтатусыРезервовАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>CRM_СтатусыРезервовАвтомобилей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаРезерв</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезервУтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезервОтклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезервСнят</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/CRM_ЗаявкаНаПодборАвтомобиля/Ext/ObjectModule.bsl
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры 

Процедура ПриЗаписи(Отказ)    	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	// Создаем запись в регистр "Резервы автомобилей"
	Если Статус = Перечисления.CRM_СтатусыЗаявокАвтосклад.Обработана
		И (ЗначениеЗаполнено(VIN) ИЛИ ЗначениеЗаполнено(НомерОрдераSedre))
		И НЕ ВАрхиве Тогда
		
		Если ЗначениеЗаполнено(VIN) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	CRM_РезервыАвтомобилей.Период,
			|	CRM_РезервыАвтомобилей.VIN,
			|	CRM_РезервыАвтомобилей.Менеджер,
			|	CRM_РезервыАвтомобилей.ЗаявкаНаРезерв
			|ИЗ
			|	РегистрСведений.CRM_РезервыАвтомобилей КАК CRM_РезервыАвтомобилей
			|ГДЕ
			|	CRM_РезервыАвтомобилей.ЗаявкаНаРезерв = &ЗаявкаНаРезерв";
			Запрос.УстановитьПараметр("ЗаявкаНаРезерв", Ссылка);
			Результат = Запрос.Выполнить().Выгрузить();
			Если Результат.Количество() Тогда
				Запись = РегистрыСведений.CRM_РезервыАвтомобилей.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись, Результат[0]);
				Запись.Прочитать();
			Иначе
				Запись = РегистрыСведений.CRM_РезервыАвтомобилей.СоздатьМенеджерЗаписи();
				Запись.Идентификатор = Новый УникальныйИдентификатор();
			КонецЕсли;
			Запись.VIN = VIN;
			Запись.Менеджер = Менеджер;
			Если ЗначениеЗаполнено(НомерОрдераSedre) Тогда
				Запись.SedreNum = НомерОрдераSedre;
			КонецЕсли;
			Запись.СтатусРезерва = Перечисления.CRM_СтатусыРезервовАвтомобилей.ЗаявкаНаРезерв;
			Запись.Период = ТекущаяДата();
			Запись.Автор = ПараметрыСеанса.Пользователь;
			Запись.Комментарий = КомментарийЛогиста;
			Запись.РабочийЛист = РабочийЛист;
			Запись.ЗаявкаНаРезерв = Ссылка;
			Запись.Записать();
			
		ИначеЕсли ЗначениеЗаполнено(НомерОрдераSedre) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	CRM_РезервыАвтомобилей.Период,
			|	CRM_РезервыАвтомобилей.VIN,
			|	CRM_РезервыАвтомобилей.Менеджер,
			|	CRM_РезервыАвтомобилей.ЗаявкаНаРезерв
			|ИЗ
			|	РегистрСведений.CRM_РезервыАвтомобилей КАК CRM_РезервыАвтомобилей
			|ГДЕ
			|	CRM_РезервыАвтомобилей.ЗаявкаНаРезерв = &ЗаявкаНаРезерв";
			Запрос.УстановитьПараметр("ЗаявкаНаРезерв", Ссылка);
			Результат = Запрос.Выполнить().Выгрузить();
			Если Результат.Количество() Тогда
				Запись = РегистрыСведений.CRM_РезервыАвтомобилей.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись, Результат[0]);
				Запись.Прочитать();
			Иначе
				Запись = РегистрыСведений.CRM_РезервыАвтомобилей.СоздатьМенеджерЗаписи();
				Запись.Идентификатор = Новый УникальныйИдентификатор();
			КонецЕсли;
			Запись.VIN = "";
			Запись.Менеджер = Менеджер;
			Запись.SedreNum = НомерОрдераSedre;
			Запись.СтатусРезерва = Перечисления.CRM_СтатусыРезервовАвтомобилей.ЗаявкаНаРезерв;
			Запись.Период = ТекущаяДата();
			Запись.Автор = ПараметрыСеанса.Пользователь;
			Запись.Комментарий = КомментарийЛогиста;
			Запись.РабочийЛист = РабочийЛист;
			Запись.ЗаявкаНаРезерв = Ссылка;
			Запись.Записать();
			
		КонецЕсли;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	CRM_РезервыАвтомобилей.Период,
		|	CRM_РезервыАвтомобилей.VIN,
		|	CRM_РезервыАвтомобилей.Менеджер,
		|	CRM_РезервыАвтомобилей.ЗаявкаНаРезерв
		|ИЗ
		|	РегистрСведений.CRM_РезервыАвтомобилей КАК CRM_РезервыАвтомобилей
		|ГДЕ
		|	CRM_РезервыАвтомобилей.ЗаявкаНаРезерв = &ЗаявкаНаРезерв";
		Запрос.УстановитьПараметр("ЗаявкаНаРезерв", Ссылка);
		Результат = Запрос.Выполнить().Выгрузить();
		Если Результат.Количество() Тогда
			Запись = РегистрыСведений.CRM_РезервыАвтомобилей.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Результат[0]);
			Запись.Прочитать();
			Запись.Удалить();
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры
